'''
Objective:
   Напишите код для определения типа переменной strange, если:
   strange = [ [],1]
'''
strange = [ [],1]
print(type(strange))    #вывод: <class 'list'>