#   Выведите на экран вашу Фамилию, Имя и номер студенческой группы.
print('Кузнецов Алексей\nБАСО-04-22')